[{"qCat":772120001,"qDelEvidence":false,"qID":"4c466f03-9478-f011-b4cb-000d3a34656f","qNotes":"Uses Cato as SSO solution integrated with Microsoft accounts, requires MFA for VPN access.","qReq":true,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120001,"qDelEvidence":false,"qID":"4d466f03-9478-f011-b4cb-000d3a34656f","qNotes":"Terminated accounts are disabled until management reviews data (30-day window), then deleted. Quarterly audits ensure no lingering disabled accounts. Same process for consultants - accounts disabled when work complete and removed during quarterly review.","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120001,"qDelEvidence":false,"qID":"ba646c09-9478-f011-b4cb-000d3a34656f","qNotes":"We Force MFA on just about everything now. We use Cato SSO with enterprise integration. Critical systems (Fidelity, Paychex, Salesforce, portals) all have MFA enabled.","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120002,"qDelEvidence":false,"qID":"c5646c09-9478-f011-b4cb-000d3a34656f","qNotes":"Yes, we have a spreadsheet that identifies PHI and PII. Updated annually. It identifies the source of the information, where it's stored, and which division is responsible for it. ","qReq":false,"qResponse":1,"qScore":1,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"c9646c09-9478-f011-b4cb-000d3a34656f","qNotes":"Yes, we have an imaging server that we use to deploy standardized system builds. The image includes all required applications, drivers, and configurations. When a new laptop is received, the existing data is completely wiped and replaced with the standardized image. We follow a configuration checklist to ensure consistency across all devices. Each setup is then audited at the next level to confirm nothing was missed, and the system is tested before deployment. The image can be updated as needed, though we typically refresh it on at least a quarterly basis.","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"739b690f-9478-f011-b4cb-000d3a34656f","qNotes":"We use a card key access control system, which restricts entry to authorized personnel only. The network switch is the only remaining on-premises infrastructure component; all other core services have been migrated to the cloud.\n","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"7d9b690f-9478-f011-b4cb-000d3a34656f","qNotes":"Server patching is performed on the third Saturday of each month. Our service provider manages and monitors the Windows servers, handling the patching process and verifying that updates are applied successfully. In addition to scheduled server maintenance, manufacturer patches are reviewed and applied daily to ensure systems remain current. The district maintains two 1-gigabit internet connections that are vendor-managed, providing both load balancing and failover capabilities","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"809b690f-9478-f011-b4cb-000d3a34656f","qNotes":"Yes, our production network is segmented from the guest network and further segmented from other parts of the overall environment","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120004,"qDelEvidence":false,"qID":"051bd215-9478-f011-b4cb-000d3a34656f","qNotes":"Yes, we use SentinelOne as our endpoint EDR/MDR solution, managed through our 24/7 SOC provider. We work with our SOC team to remediate threats and incidents as they arise.","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120005,"qDelEvidence":false,"qID":"0a1bd215-9478-f011-b4cb-000d3a34656f","qNotes":"They are done daily, weekly, and monthly backups. Monthly backup is retained for 24 months on a rotating basis. Legal holds can extend retention indefinitely.","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120006,"qDelEvidence":false,"qID":"0b1bd215-9478-f011-b4cb-000d3a34656f","qNotes":"We send out monthly security awareness updates that include videos and quizzes through Proofpoint. ","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120006,"qDelEvidence":false,"qID":"0c1bd215-9478-f011-b4cb-000d3a34656f","qNotes":"Yes, we conduct phishing tests on a monthly basis, sometimes once or twice a month. Some campaigns are targeted to specific groups or divisions. These test are managed by our training staff, who also design and oversee the phishing emails.","qReq":true,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120007,"qDelEvidence":false,"qID":"201bd215-9478-f011-b4cb-000d3a34656f","qNotes":"Vendor inventory maintained in OneTrust and separate database/spreadsheet. Created comprehensive list when starting InfoSec surveys by working with all divisions. Accounting also maintains vendor list.","qReq":false,"qResponse":1,"qScore":1,"qVerified":false,"qdocID":null},{"qCat":772120007,"qDelEvidence":false,"qID":"241bd215-9478-f011-b4cb-000d3a34656f","qNotes":"Yes, Verbal confirmation obtained. Process documented and signed off by Controller (Carolyn)","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120007,"qDelEvidence":false,"qID":"8a49e21b-9478-f011-b4cb-000d3a34656f","qNotes":"Two-person rule: first person creates/prepares wire transfer, second person must release it. Only three people in company authorized to execute wire transfers.","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120008,"qDelEvidence":false,"qID":"8b49e21b-9478-f011-b4cb-000d3a34656f","qNotes":"Plan exists and is documented.","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120008,"qDelEvidence":false,"qID":"9549e21b-9478-f011-b4cb-000d3a34656f","qNotes":"Communication plan and contacts included in CIRP.","qReq":false,"qResponse":1,"qScore":1,"qVerified":false,"qdocID":null},{"qCat":772120001,"qDelEvidence":false,"qID":"b049e21b-9478-f011-b4cb-000d3a34656f","qNotes":"Yes, Everything on the M365 Tenant has DUO multi-factor authentication. Re-authentication required after 90 days. We support Push notifications and also utilize physical tokens.","qReq":true,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120001,"qDelEvidence":false,"qID":"b9c7ed21-9478-f011-b4cb-000d3a34656f","qNotes":"12 characters minimum, upper/lower/number/special, 90-day expiry. Cannot reuse password within a year. Cannot change password multiple times in one day. Active Directory prevents using username in password.","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120002,"qDelEvidence":false,"qID":"92a1970a-9478-f011-b4cc-00224804279b","qNotes":"We have dedicated admin accounts that are enabled only when needed and disabled when not in use, following a process similar to Just-In-Time (JIT) access control.","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"9da1970a-9478-f011-b4cc-00224804279b","qNotes":"We harden all servers during the build process, which includes applying OS updates and security configurations as a standard practice. We also implement MAC address filtering, meaning devices must be on an approved list before they can connect to the network. Our Aruba wireless system serves as the management console for these controls. When a device is retired, its MAC address is removed from the list, and new devices are added as needed.","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"7114c210-9478-f011-b4cc-00224804279b","qNotes":"10 minutes for laptop and iPhone are almost instant. ","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"7a14c210-9478-f011-b4cc-00224804279b","qNotes":"Yes, network access is protected through MAC address filtering, and the wireless networks are hidden — the SSIDs are not broadcast or publicly visible.\n","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"7b14c210-9478-f011-b4cc-00224804279b","qNotes":"We don't have any publicly shared keys. ","qReq":false,"qResponse":0,"qScore":0,"qVerified":false,"qdocID":null},{"qCat":772120005,"qDelEvidence":false,"qID":"3301bc17-9478-f011-b4cc-00224804279b","qNotes":"Our vendor performs monthly restoration testing to confirm backup integrity. We have also successfully completed full server restores but on a needed basis. We have not established a regular process for testing our recovery capabilities. ","qReq":true,"qResponse":3,"qScore":15,"qVerified":false,"qdocID":null},{"qCat":772120008,"qDelEvidence":false,"qID":"3b01bc17-9478-f011-b4cc-00224804279b","qNotes":"Ashu is Chief Information Officer responsible for security and privacy, serves as internal liaison with vendors (Allied World for cyber insurance, US Signal for XDR/MDR) during incidents.","qReq":false,"qResponse":1,"qScore":1,"qVerified":false,"qdocID":null},{"qCat":772120000,"qDelEvidence":false,"qID":"5adc321e-9478-f011-b4cc-00224804279b","qNotes":"We do have an asset database. We keep records of all equipment over $100, including workstations, tablets, phones, and peripheral equipment(headphones, webcams, etc). We log make, model, serial number, and purchase date. We track who the device is assigned to and the division it belongs to. There is also a historical trail of users of who the device was previously assigned to. We also utilize asset tags on our equipment. ","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120000,"qDelEvidence":false,"qID":"5bdc321e-9478-f011-b4cc-00224804279b","qNotes":"Yes, we do have some licensed software in the asset database. We keep track of the license amount, who uses it, the division assigned to, and the date of purchase. We also utilize PDQ to audit installed software. Other licensing for cloud products like Adobe and Microsoft are all managed through the product management portal.","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120000,"qDelEvidence":false,"qID":"5cdc321e-9478-f011-b4cc-00224804279b","qNotes":"Yes, we utilize Dark Trace. It will identify and notify of any unrecognized devices on our network (wired and wireless) and take reactive steps to remove that device.  Network ports that dont already have a network cable do not have an active internet connection. ","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120001,"qDelEvidence":false,"qID":"f9fae405-9478-f011-b4cb-0022480aaebb","qNotes":"We use a database-driven form initiated by HR or division head. Form includes all required access, equipment needs, modeling after existing user, start date. IT team images/deploys equipment, sets up at desk. In-house trainer conducts onboarding covering login procedures, security requirements. Password reset day before start with default password that must be changed on first login.","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120001,"qDelEvidence":false,"qID":"43fce405-9478-f011-b4cb-0022480aaebb","qNotes":"MFA is required for Windows servers. HCL Domino on Power10 (AS/400) doesn't have direct MFA, but is protected by network-level MFA - must authenticate through a device with MFA to access. Has ACLs on databases for access control.","qReq":true,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120001,"qDelEvidence":false,"qID":"5ffce405-9478-f011-b4cb-0022480aaebb","qNotes":"Same database form used for terminations. Accounts disabled for 30 days for management data review, then deleted. Quarterly audits ensure cleanup of old accounts.","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"c697eb0b-9478-f011-b4cb-0022480aaebb","qNotes":"Yes, we have a patch management process in place using both PDQ and Intune. Our team handles desktop patching internally — we first test updates on our own systems, and then push them out to all end users later. ","qReq":true,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"0198eb0b-9478-f011-b4cb-0022480aaebb","qNotes":"Yes, we perform regular external vulnerability scans using EdgeScan and Rapid7 throughout the week to identify and address potential issues. We also conduct an annual penetration test.\n","qReq":true,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"0b98eb0b-9478-f011-b4cb-0022480aaebb","qNotes":"Updates are performed on a regular basis. In addition, we update the software applications that we manage to ensure they remain current and secure. PDQ and Intune are used to support and manage the update process across systems.","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120004,"qDelEvidence":false,"qID":"25dbe311-9478-f011-b4cb-0022480aaebb","qNotes":"We do not use a dedicated DNS filtering product however, web and content filtering are enforced through the Cato firewall.\n","qReq":false,"qResponse":3,"qScore":15,"qVerified":false,"qdocID":null},{"qCat":772120004,"qDelEvidence":false,"qID":"bbdbe311-9478-f011-b4cb-0022480aaebb","qNotes":"We use SentinelOne as our primary EDR/MDR solution, managed through our 24/7 SOC provider. Microsoft Defender is also present on endpoints but operates as a secondary layer of protection.","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120005,"qDelEvidence":false,"qID":"c6dbe311-9478-f011-b4cb-0022480aaebb","qNotes":"Vendor uses Cohesity for Windows server backups. Zerto for DR-as-a-Service replication. Power10 has flash copy replication plus RMS backups (product name not recalled). M365 backed up daily by vendor (Acronis for M365) - mailboxes, SharePoint, OneDrive, Teams.","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120001,"qDelEvidence":false,"qID":"11e3d61d-9478-f011-b4cb-0022480aaebb","qNotes":"Hybrid environment with on-prem Active Directory synced to Entra ID via Azure AD Connect. Conducts yearly/quarterly audits of all accounts including cloud vendor accounts. Domain admin accounts are separate from daily-use accounts and kept disabled until needed.","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120008,"qDelEvidence":false,"qID":"b032c58a-fc8f-f011-b4cb-0022480aaebb","qNotes":"","qReq":true,"qResponse":0,"qScore":0,"qVerified":false,"qdocID":null},{"qCat":772120002,"qDelEvidence":false,"qID":"f3542c09-9478-f011-b4cc-6045bd020f75","qNotes":"All endpoint devices are encrypted using BitLocker. The Power10 SANs and Windows-based servers are also configured with encryption enabled. On-premises backups are also encrypted. \n","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"b7863c0f-9478-f011-b4cc-6045bd020f75","qNotes":"Yes, we maintain separate networks and subnets for employees and non-employees. Network switches are segmented by division, so if a device in Finance were compromised, the issue would remain isolated and could not spread across other departments. Unused ports are disabled to prevent unauthorized access. Non-employees, such as consultants, connect through a VDI environment, which provides access only to approved servers and resources.","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120003,"qDelEvidence":false,"qID":"f9863c0f-9478-f011-b4cc-6045bd020f75","qNotes":"Yes we do.","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120004,"qDelEvidence":false,"qID":"d1313c15-9478-f011-b4cc-6045bd020f75","qNotes":"Yes, we use Proofpoint for security and data loss prevention (DLP), along with Microsoft 365’s built-in filtering features.","qReq":false,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120005,"qDelEvidence":false,"qID":"0b323c15-9478-f011-b4cc-6045bd020f75","qNotes":"Backups are encrypted and immutable, managed by off-site vendor.","qReq":true,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null},{"qCat":772120006,"qDelEvidence":false,"qID":"14323c15-9478-f011-b4cc-6045bd020f75","qNotes":"Yes, for users who click on simulated phishing emails. The training does adjust based on the number of clicks one user might have over a period of time.","qReq":true,"qResponse":1,"qScore":1,"qVerified":false,"qdocID":null},{"qCat":772120007,"qDelEvidence":false,"qID":"15323c15-9478-f011-b4cc-6045bd020f75","qNotes":"The process is twofold. First, we use a tool called OneTrust, where we load and distribute security questionnaires to vendors. Vendors are expected to complete and return these questionnaires, after which an internal evaluation is conducted. As part of the review, we also examine SOC reports to identify any potential issues.\nA dedicated ITS Risk Management Group is responsible for sending out questionnaires, performing evaluations, and handling escalations. The group meets monthly to follow up on outstanding items and vendor delays. Within the group, a ITS Risk Subgroup manages escalations and forwards any concerns to Ashu for further review.","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120007,"qDelEvidence":false,"qID":"d20f521b-9478-f011-b4cc-6045bd020f75","qNotes":"Done during initial vendor onboarding - call to verify, test transaction. Not done for every ongoing transaction or regularly thereafter.","qReq":false,"qResponse":3,"qScore":9,"qVerified":false,"qdocID":null},{"qCat":772120008,"qDelEvidence":false,"qID":"d80f521b-9478-f011-b4cc-6045bd020f75","qNotes":"Yes, Conducted two tabletops this year (started in 2024) - one for general staff, one targeted to executives. Plan to leverage free tabletops from cyber insurance provider (Allied World). ","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120008,"qDelEvidence":false,"qID":"e90f521b-9478-f011-b4cc-6045bd020f75","qNotes":"Responsibilities defined in plan.","qReq":false,"qResponse":1,"qScore":3,"qVerified":false,"qdocID":null},{"qCat":772120000,"qDelEvidence":false,"qID":"f80f521b-9478-f011-b4cc-6045bd020f75","qNotes":"No current end-of-life software identified. Yearly audit process to review all software, check versions, and plan updates. ","qReq":true,"qResponse":1,"qScore":5,"qVerified":false,"qdocID":null}]

