{
  "introduction": {
    "what_is_assessment": "A cyber risk assessment is the process of identifying, evaluating, and prioritizing potential security threats to an organization's assets and infrastructure. This includes analyzing the likelihood and impact of these risks and determining the measures and controls to be put in place to mitigate them. The goal of a cyber risk assessment is to improve an organization's cybersecurity posture and prevent data breaches, unauthorized access, and other types of cyber-attacks.",
    "methodology": "The following categories have been derived from previous version of the risk assessment which questions were influenced from previous cyber insurance claims, cybersecurity best practices, and common knowledge derived from the cybersecurity industry and as outlined by organizations such as NIST (National Institute of Standards and Technology), CISA (Cybersecurity and Infrastructure Security Agency) and CIS (Center for Internet Security).",
    "recommendation": "It is recommended that organizations schedule a review meeting with appropriate district personnel to discuss identified risks and to define remediation actions.",
    "grading_update": "As of September 2025, and in alignment with our continuous improvement practices across all Cyber Toolkit services, CyberPools has enhanced the grading formula used in this assessment. The updated methodology ensures that scores more accurately reflect implementation status across each control category and the overall assessment.",
    "emphasis": "While the overall score provides a high-level benchmark, members should place greater emphasis on the control categories and the associated risk ratings (Low, Medium, High). These ratings highlight which areas carry greater weight in reducing organizational risk and therefore warrant more focused attention during remediation planning.",
    "contact": "For any questions about our risk assessment or grading, please reach out to cyber@cyberpools.org"
  },
  "rating_legends": {
    "control_ratings": {
      "fully_implemented": {
        "value": 1,
        "label": "Fully Implemented",
        "description": "Control(s) are fully implemented and effective at mitigating risk."
      },
      "partially_implemented": {
        "value": 3,
        "label": "Partially Implemented",
        "description": "Controls are partially implemented and somewhat effective in mitigating risk."
      },
      "not_implemented": {
        "value": 5,
        "label": "Not Implemented",
        "description": "Control(s) are nonexistent."
      },
      "not_applicable": {
        "value": 0,
        "label": "Not Applicable",
        "description": "Control(s) are not necessary or applicable to the environment."
      }
    },
    "impact_ratings": {
      "low": {
        "value": 1,
        "label": "Low",
        "description": "Minimal disruption of operations and no sensitive data compromised or exfiltrated."
      },
      "moderate": {
        "value": 3,
        "label": "Moderate",
        "description": "Operational disruptions of operations but no sensitive data compromised or exfiltrated."
      },
      "high": {
        "value": 5,
        "label": "High",
        "description": "Significant disruption of operations and sensitive data compromised or exfiltrated."
      },
      "not_applicable": {
        "value": 0,
        "label": "Not Applicable",
        "description": "No impact to your organization or environment as a result of the missing control."
      }
    },
    "risk_ratings": {
      "low": {
        "range": "0-9",
        "label": "Low",
        "description": "Overall risk is low to organization"
      },
      "moderate": {
        "range": "10-15",
        "label": "Moderate",
        "description": "Overall risk is moderate to organization"
      },
      "high": {
        "range": "16-25",
        "label": "High",
        "description": "Overall risk is high to organization."
      },
      "not_applicable": {
        "range": "0",
        "label": "Not Applicable",
        "description": "No risk posed as a result of the missing control."
      }
    },
    "example": {
      "control": "Multi-factor Authentication",
      "control_rating": "Partially Implemented (3)",
      "impact_rating": "High (5)",
      "calculation": "3 x 5 = 15",
      "result": "15 scores as moderate risk based on risk rating legend above."
    }
  },
  "categories": {
    "1.0": {
      "name": "Inventory and Control of Assets",
      "overview": "Inventory and Control of Assets refers to the practice of keeping track of all the devices an organization owns or uses, such as computers and servers. This enables the organization to know where everything is, who owns it, and whether there are any security issues. Having control over assets means implementing processes to manage, secure, and track them effectively, and to prevent unauthorized access. It also helps to identify unauthorized and unmanaged assets to remove or remediate them, reducing cybersecurity risks. Maintaining an inventory and control of assets is a critical component of any organization's cybersecurity program.",
      "importance": "Having an up-to-date inventory and control of assets helps organizations identify and prioritize security risks and implement the appropriate controls to mitigate them. Many regulatory and insurance requirements may mandate that organizations maintain an inventory of their assets. Failing to do so can result in non-compliance and potential penalties and fines. Having a complete and accurate inventory of assets enables organizations to quickly determine the extent of a security incident and respond appropriately. Having an inventory and control of assets helps organizations make informed decisions about resource allocation and prioritize the protection of their most critical and valuable assets. Enterprises cannot defend what they do not know they have. Managed control of all enterprise assets also plays a critical role in security monitoring, incident response, system backup, and recovery. Having control over assets helps organizations monitor network activity and detect security threats, improving their overall security posture. In summary, having an inventory and control of enterprise assets (physical and software) is crucial for organizations to effectively manage risk, maintain compliance, and improve their overall security posture."
    },
    "2.0": {
      "name": "Account Management",
      "overview": "Account management is the practice of managing user accounts and their access to an organization's systems and data. This includes creating and deleting accounts, setting permissions and access levels, and regularly reviewing and updating account information. Cybersecurity best practices recommend implementing strong password policies, multi-factor authentication, and limiting access to only what is necessary for each user's job function. Regular monitoring and auditing of account activity can help detect and respond to potential security incidents.",
      "importance": "Effective account management is critical for managing cybersecurity risks and preventing unauthorized access, as it limits access to only authorized users and reduces insider threats. By enforcing strong password policies, regularly reviewing account activity, and promptly detecting and responding to security incidents, organizations can enhance password security and mitigate the risk of potential security incidents. Additionally, effective account management enables organizations to comply with regulations and standards, avoiding costly fines and reputational damage. In summary, a good account management process is essential for maintaining the confidentiality, integrity, and availability of an organization's systems and data."
    },
    "3.0": {
      "name": "Data Protection",
      "overview": "Data protection is the practice of protecting sensitive and confidential information from unauthorized access, use, or damage. This requires implementing technical, administrative, and physical controls to ensure the confidentiality, integrity, and availability of data. Effective data protection is essential for maintaining customer trust, complying with regulations and standards, and preventing data breaches. By implementing robust data protection measures, organizations can reduce the risk of cyber-attacks, data loss, or theft, and safeguard the continuity of their operations.",
      "importance": "In today's distributed digital landscape, data is often stored beyond an enterprise's borders on the cloud, portable devices used for remote work, or shared with partners and online services across the world. As a result, protecting sensitive financial, intellectual property, and customer data is critical, especially given the many international regulations related to personal data. Effective data privacy management involves appropriate use and management of data throughout its entire lifecycle, not just encryption. Though privacy rules can be complex, fundamental principles apply to all multinational enterprises."
    },
    "4.0": {
      "name": "Secure Configuration of Enterprise Assets",
      "overview": "Secure configuration of enterprise assets refers to the process of configuring devices such as firewalls, routers, servers, and laptops in a secure and standardized manner. This involves ensuring that default configurations are changed, unnecessary services are disabled, and software is patched and updated regularly. Effective secure configuration reduces the attack surface of an organization's systems and prevents many common security vulnerabilities.",
      "importance": "Default configurations for enterprise assets and software are often geared towards ease-of-use, rather than security, and can include exploitable vulnerabilities. As a result, secure configuration updates must be managed and maintained throughout the lifecycle of enterprise assets and software. Effective secure configuration involves tracking and approving configuration updates through a formal workflow process to maintain a compliance record. Implementing secure configuration of enterprise assets is crucial for reducing the attack surface of an organization's systems and preventing many common security vulnerabilities. By configuring devices in a secure and standardized manner, organizations can enhance their security posture and reduce the risk of data breaches and other security incidents."
    },
    "5.0": {
      "name": "Malware Defense",
      "overview": "Preventing the installation, spread, and execution of malicious software on enterprise assets is critical for malware defense. To achieve this goal, organizations need preventative controls such as antivirus software and DNS (Domain Name System) filtering, as well as detective controls like endpoint detection and response (EDR) tools. By monitoring endpoint activity, EDR tools can detect and respond to threats in real-time, reducing the risk of data breaches and reputational damage. Implementing a comprehensive malware defense strategy that includes preventative and detective controls can significantly enhance an organization's security posture.",
      "importance": "Malware is an evolving and dangerous aspect of internet threats, which can have a range of purposes from stealing data to destroying it. Effective malware defense requires timely updates, automation, and integration with other processes like vulnerability management and incident response. Deploying malware defenses across all possible entry points and enterprise assets is crucial to detect, prevent, and control the execution of malicious software. By implementing robust malware defense measures, organizations can reduce the risk of cyber-attacks, data breaches, and reputational damage."
    },
    "6.0": {
      "name": "Data Recovery",
      "overview": "Effective data recovery practices are crucial for protecting critical data and ensuring business continuity. Organizations should implement procedures to restore enterprise assets to a pre-incident state, including regularly backing up critical data, testing recovery processes, and implementing failover systems. By maintaining robust data recovery practices and incident response procedures, organizations can reduce the impact of security incidents and ensure compliance with regulations and standards.",
      "importance": "Effective data recovery practices are essential for ensuring the continuity of business operations and protecting critical data. By establishing procedures to restore in-scope enterprise assets to a trusted state, organizations can reduce the impact of security incidents and minimize downtime. Additionally, maintaining robust data recovery practices helps organizations comply with regulations and standards, maintain customer trust, and protect their reputation."
    },
    "7.0": {
      "name": "Security Awareness",
      "overview": "Establish and maintain a security awareness program to influence behavior among the workforce to be security conscious and properly skilled to reduce cybersecurity risks to the enterprise.",
      "importance": "Cyber security awareness is essential for organizations to protect their systems, data, and reputation from cyber threats. By educating employees on cyber risks and best practices, organizations can reduce the risk of data breaches, malware infections, and other security incidents. Additionally, cyber security awareness helps to promote a culture of security within the organization, improving compliance with regulations and standards. Finally, cyber security awareness training can help organizations prepare for potential security incidents and respond effectively if they do occur, minimizing the impact on operations and reputation."
    },
    "8.0": {
      "name": "Vendor Management",
      "overview": "Develop and maintain process to evaluate vendors who hold sensitive data or are responsible for an enterprise's critical IT platforms or processes, to ensure these providers are protecting those platforms and data appropriately. Additionally, there should be an emphasis placed on secure financial practices throughout the organization with respect to payment of vendors.",
      "importance": "In today's connected world, enterprises rely on third-party vendors and partners to manage their data or supply critical infrastructure for core functions. However, third-party breaches can significantly affect an enterprise, compromising sensitive data or causing disruption to business operations. Third-party providers are attractive targets for cyber-attacks, as they often have access to multiple clients' networks. By effectively managing service providers, implementing strict security and financial controls, organizations can reduce the risk of third-party breaches and ensure the security of their systems and data."
    },
    "9.0": {
      "name": "Incident Response Management",
      "overview": "Establish a program to develop and maintain an incident response capability (e.g., policies, plans, procedures, defined roles, training, and communications) to prepare, detect, and quickly respond to an attack.",
      "importance": "Effective incident response is a critical component of a comprehensive cybersecurity program. By quickly identifying and responding to threats, organizations can prevent their spread and minimize the impact of security incidents. Incident response also plays a crucial role in understanding the full scope of an incident, identifying its root cause, and implementing measures to prevent future occurrences. Without effective incident response capabilities, organizations risk being stuck in a reactive pattern, constantly addressing symptoms rather than root causes."
    }
  }
}